bruno/biometria-legacy-soap/consultar-biometria-sem-secret-bloqueado.bru

meta {
  name: Consultar biometria - sem X-Core-Secret (deve bloquear)
  type: http
  seq: 3
}

post {
  url: {{baseUrl}}/ws
  body: xml
  auth: none
}

headers {
  Content-Type: text/xml; charset=utf-8
  SOAPAction: ""
}

body:xml {
  <?xml version="1.0" encoding="UTF-8"?>
  <soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:tns="http://vivo.com.br/poc/biometria">
    <soapenv:Header/>
    <soapenv:Body>
      <tns:ConsultarBiometriaRequest>
        <tns:cpf>52998224725</tns:cpf>
      </tns:ConsultarBiometriaRequest>
    </soapenv:Body>
  </soapenv:Envelope>
}

assert {
  res.status: eq 403
  res.body: contains UNAUTHORIZED
}
